ZigEmbeddedGroup/microzig/port/espressif/esp/src/chips/ESP32-C6.svd
        <register>
          <name>REGION5_PMS_ATTR</name>
          <description>Region access authority attribute register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION5_R0_PMS_X</name>
              <description>Region execute authority in REE_MODE0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION5_R0_PMS_W</name>
              <description>Region write authority in REE_MODE0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION5_R0_PMS_R</name>
              <description>Region read authority in REE_MODE0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION5_R1_PMS_X</name>
              <description>Region execute authority in REE_MODE1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION5_R1_PMS_W</name>
              <description>Region write authority in REE_MODE1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION5_R1_PMS_R</name>
              <description>Region read authority in REE_MODE1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION5_R2_PMS_X</name>
              <description>Region execute authority in REE_MODE2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION5_R2_PMS_W</name>
              <description>Region write authority in REE_MODE2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION5_R2_PMS_R</name>
              <description>Region read authority in REE_MODE2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION6_ADDR_START</name>
          <description>Region address register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION6_ADDR_START</name>
              <description>Start address of region6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION6_ADDR_END</name>
          <description>Region address register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>REGION6_ADDR_END</name>
              <description>End address of region6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION6_PMS_ATTR</name>
          <description>Region access authority attribute register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION6_R0_PMS_X</name>
              <description>Region execute authority in REE_MODE0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION6_R0_PMS_W</name>
              <description>Region write authority in REE_MODE0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION6_R0_PMS_R</name>
              <description>Region read authority in REE_MODE0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION6_R1_PMS_X</name>
              <description>Region execute authority in REE_MODE1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION6_R1_PMS_W</name>
              <description>Region write authority in REE_MODE1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION6_R1_PMS_R</name>
              <description>Region read authority in REE_MODE1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION6_R2_PMS_X</name>
              <description>Region execute authority in REE_MODE2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION6_R2_PMS_W</name>
              <description>Region write authority in REE_MODE2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION6_R2_PMS_R</name>
              <description>Region read authority in REE_MODE2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION7_ADDR_START</name>
          <description>Region address register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION7_ADDR_START</name>
              <description>Start address of region7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION7_ADDR_END</name>
          <description>Region address register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>REGION7_ADDR_END</name>
              <description>End address of region7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION7_PMS_ATTR</name>
          <description>Region access authority attribute register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION7_R0_PMS_X</name>
              <description>Region execute authority in REE_MODE0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION7_R0_PMS_W</name>
              <description>Region write authority in REE_MODE0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION7_R0_PMS_R</name>
              <description>Region read authority in REE_MODE0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION7_R1_PMS_X</name>
              <description>Region execute authority in REE_MODE1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION7_R1_PMS_W</name>
              <description>Region write authority in REE_MODE1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION7_R1_PMS_R</name>
              <description>Region read authority in REE_MODE1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION7_R2_PMS_X</name>
              <description>Region execute authority in REE_MODE2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION7_R2_PMS_W</name>
              <description>Region write authority in REE_MODE2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION7_R2_PMS_R</name>
              <description>Region read authority in REE_MODE2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION8_ADDR_START</name>
          <description>Region address register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION8_ADDR_START</name>
              <description>Start address of region8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION8_ADDR_END</name>
          <description>Region address register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>REGION8_ADDR_END</name>
              <description>End address of region8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION8_PMS_ATTR</name>
          <description>Region access authority attribute register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION8_R0_PMS_X</name>
              <description>Region execute authority in REE_MODE0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION8_R0_PMS_W</name>
              <description>Region write authority in REE_MODE0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION8_R0_PMS_R</name>
              <description>Region read authority in REE_MODE0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION8_R1_PMS_X</name>
              <description>Region execute authority in REE_MODE1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION8_R1_PMS_W</name>
              <description>Region write authority in REE_MODE1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION8_R1_PMS_R</name>
              <description>Region read authority in REE_MODE1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION8_R2_PMS_X</name>
              <description>Region execute authority in REE_MODE2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION8_R2_PMS_W</name>
              <description>Region write authority in REE_MODE2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION8_R2_PMS_R</name>
              <description>Region read authority in REE_MODE2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION9_ADDR_START</name>
          <description>Region address register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION9_ADDR_START</name>
              <description>Start address of region9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION9_ADDR_END</name>
          <description>Region address register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>REGION9_ADDR_END</name>
              <description>End address of region9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION9_PMS_ATTR</name>
          <description>Region access authority attribute register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION9_R0_PMS_X</name>
              <description>Region execute authority in REE_MODE0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION9_R0_PMS_W</name>
              <description>Region write authority in REE_MODE0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION9_R0_PMS_R</name>
              <description>Region read authority in REE_MODE0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION9_R1_PMS_X</name>
              <description>Region execute authority in REE_MODE1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION9_R1_PMS_W</name>
              <description>Region write authority in REE_MODE1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION9_R1_PMS_R</name>
              <description>Region read authority in REE_MODE1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION9_R2_PMS_X</name>
              <description>Region execute authority in REE_MODE2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION9_R2_PMS_W</name>
              <description>Region write authority in REE_MODE2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION9_R2_PMS_R</name>
              <description>Region read authority in REE_MODE2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION10_ADDR_START</name>
          <description>Region address register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION10_ADDR_START</name>
              <description>Start address of region10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION10_ADDR_END</name>
          <description>Region address register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>REGION10_ADDR_END</name>
              <description>End address of region10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION10_PMS_ATTR</name>
          <description>Region access authority attribute register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION10_R0_PMS_X</name>
              <description>Region execute authority in REE_MODE0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION10_R0_PMS_W</name>
              <description>Region write authority in REE_MODE0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION10_R0_PMS_R</name>
              <description>Region read authority in REE_MODE0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION10_R1_PMS_X</name>
              <description>Region execute authority in REE_MODE1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION10_R1_PMS_W</name>
              <description>Region write authority in REE_MODE1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION10_R1_PMS_R</name>
              <description>Region read authority in REE_MODE1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION10_R2_PMS_X</name>
              <description>Region execute authority in REE_MODE2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION10_R2_PMS_W</name>
              <description>Region write authority in REE_MODE2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION10_R2_PMS_R</name>
              <description>Region read authority in REE_MODE2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION11_ADDR_START</name>
          <description>Region address register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION11_ADDR_START</name>
              <description>Start address of region11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION11_ADDR_END</name>
          <description>Region address register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>REGION11_ADDR_END</name>
              <description>End address of region11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
