ZigEmbeddedGroup/microzig/port/espressif/esp/src/chips/ESP32-C6.svd
        <register>
          <name>FAULT_DETECT</name>
          <description>Fault detection configuration and status</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>F0_EN</name>
              <description>When set, event_f0 generation is enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>F1_EN</name>
              <description>When set, event_f1 generation is enabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>F2_EN</name>
              <description>When set, event_f2 generation is enabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>F0_POLE</name>
              <description>Set event_f0 trigger polarity on FAULT2 source from GPIO matrix. 0: level low, 1: level high</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>F1_POLE</name>
              <description>Set event_f1 trigger polarity on FAULT2 source from GPIO matrix. 0: level low, 1: level high</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>F2_POLE</name>
              <description>Set event_f2 trigger polarity on FAULT2 source from GPIO matrix. 0: level low, 1: level high</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVENT_F0</name>
              <description>Set and reset by hardware. If set, event_f0 is on going</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EVENT_F1</name>
              <description>Set and reset by hardware. If set, event_f1 is on going</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EVENT_F2</name>
              <description>Set and reset by hardware. If set, event_f2 is on going</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_TIMER_CFG</name>
          <description>Configure capture timer</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAP_TIMER_EN</name>
              <description>When set, capture timer incrementing under APB_clk is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP_SYNCI_EN</name>
              <description>When set, capture timer sync is enabled.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP_SYNCI_SEL</name>
              <description>capture module sync input selection. 0: none, 1: timer0 sync_out, 2: timer1 sync_out, 3: timer2 sync_out, 4: SYNC0 from GPIO matrix, 5: SYNC1 from GPIO matrix, 6: SYNC2 from GPIO matrix</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP_SYNC_SW</name>
              <description>When reg_cap_synci_en is 1,  write 1 will trigger a capture timer sync, capture timer is loaded with value in phase register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_TIMER_PHASE</name>
          <description>Phase for capture timer sync</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAP_PHASE</name>
              <description>Phase value for capture timer sync operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_CH0_CFG</name>
          <description>Capture channel 0 configuration and enable</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAP0_EN</name>
              <description>When set, capture on channel 0 is enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP0_MODE</name>
              <description>Edge of capture on channel 0 after prescaling. When bit0 is set to 1: enable capture on the negative edge, When bit1 is set to 1: enable capture on the positive edge.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP0_PRESCALE</name>
              <description>Value of prescaling on possitive edge of CAP0. Prescale value = PWM_CAP0_PRESCALE + 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP0_IN_INVERT</name>
              <description>when set, CAP0 form GPIO matrix is inverted before prescale</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP0_SW</name>
              <description>Write 1 will trigger a software forced capture on channel 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_CH1_CFG</name>
          <description>Capture channel 1 configuration and enable</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAP1_EN</name>
              <description>When set, capture on channel 2 is enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP1_MODE</name>
              <description>Edge of capture on channel 1 after prescaling. When bit0 is set to 1: enable capture on the negative edge, When bit1 is set to 1: enable capture on the positive edge.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP1_PRESCALE</name>
              <description>Value of prescaling on possitive edge of CAP1. Prescale value = PWM_CAP1_PRESCALE + 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP1_IN_INVERT</name>
              <description>when set, CAP1 form GPIO matrix is inverted before prescale</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP1_SW</name>
              <description>Write 1 will trigger a software forced capture on channel 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_CH2_CFG</name>
          <description>Capture channel 2 configuration and enable</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAP2_EN</name>
              <description>When set, capture on channel 2 is enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP2_MODE</name>
              <description>Edge of capture on channel 2 after prescaling. When bit0 is set to 1: enable capture on the negative edge, When bit1 is set to 1: enable capture on the positive edge.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP2_PRESCALE</name>
              <description>Value of prescaling on possitive edge of CAP2. Prescale value = PWM_CAP2_PRESCALE + 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP2_IN_INVERT</name>
              <description>when set, CAP2 form GPIO matrix is inverted before prescale</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP2_SW</name>
              <description>Write 1 will trigger a software forced capture on channel 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_CH0</name>
          <description>ch0 capture value status register</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAP0_VALUE</name>
              <description>Value of last capture on channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_CH1</name>
          <description>ch1 capture value status register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAP1_VALUE</name>
              <description>Value of last capture on channel 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_CH2</name>
          <description>ch2 capture value status register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAP2_VALUE</name>
              <description>Value of last capture on channel 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_STATUS</name>
          <description>Edge of last capture trigger</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAP0_EDGE</name>
              <description>Edge of last capture trigger on channel 0, 0: posedge, 1: negedge</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAP1_EDGE</name>
              <description>Edge of last capture trigger on channel 1, 0: posedge, 1: negedge</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAP2_EDGE</name>
              <description>Edge of last capture trigger on channel 2, 0: posedge, 1: negedge</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UPDATE_CFG</name>
          <description>Enable update.</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000055</resetValue>
          <fields>
            <field>
              <name>GLOBAL_UP_EN</name>
              <description>The global enable of update of all active registers in MCPWM module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GLOBAL_FORCE_UP</name>
              <description>a toggle (software invert its value) will trigger a forced update of all active registers in MCPWM module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP0_UP_EN</name>
              <description>When set and PWM_GLOBAL_UP_EN is set, update of active registers in PWM operator 0 are enabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP0_FORCE_UP</name>
              <description>a toggle (software invert its value) will trigger a forced update of active registers in PWM operator 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP1_UP_EN</name>
              <description>When set and PWM_GLOBAL_UP_EN is set, update of active registers in PWM operator 1 are enabled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP1_FORCE_UP</name>
              <description>a toggle (software invert its value) will trigger a forced update of active registers in PWM operator 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP2_UP_EN</name>
              <description>When set and PWM_GLOBAL_UP_EN is set, update of active registers in PWM operator 2 are enabled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP2_FORCE_UP</name>
              <description>a toggle (software invert its value) will trigger a forced update of active registers in PWM operator 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
