ZigEmbeddedGroup/microzig/port/espressif/esp/src/chips/ESP32-C6.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PCR</name>
      <description>PCR Peripheral</description>
      <groupName>PCR</groupName>
      <baseAddress>0x60096000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x14C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>UART0_CONF</name>
          <description>UART0 configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>UART0_CLK_EN</name>
              <description>Set 1 to enable uart0 apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0_RST_EN</name>
              <description>Set 0 to reset uart0 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART0_SCLK_CONF</name>
          <description>UART0_SCLK configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00700000</resetValue>
          <fields>
            <field>
              <name>UART0_SCLK_DIV_A</name>
              <description>The  denominator of the frequency divider factor of the uart0 function clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0_SCLK_DIV_B</name>
              <description>The numerator of the frequency divider factor of the uart0 function clock.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0_SCLK_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the uart0 function clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0_SCLK_SEL</name>
              <description>set this field to select clock-source. 0: do not select anyone clock, 1: 80MHz, 2: FOSC, 3(default): XTAL.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0_SCLK_EN</name>
              <description>Set 1 to enable uart0 function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART0_PD_CTRL</name>
          <description>UART0 power control register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>UART0_MEM_FORCE_PU</name>
              <description>Set this bit to force power down UART0 memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0_MEM_FORCE_PD</name>
              <description>Set this bit to force power up UART0 memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART1_CONF</name>
          <description>UART1 configuration register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>UART1_CLK_EN</name>
              <description>Set 1 to enable uart1 apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_RST_EN</name>
              <description>Set 0 to reset uart1 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART1_SCLK_CONF</name>
          <description>UART1_SCLK configuration register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00700000</resetValue>
          <fields>
            <field>
              <name>UART1_SCLK_DIV_A</name>
              <description>The  denominator of the frequency divider factor of the uart1 function clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_SCLK_DIV_B</name>
              <description>The numerator of the frequency divider factor of the uart1 function clock.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_SCLK_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the uart1 function clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_SCLK_SEL</name>
              <description>set this field to select clock-source. 0: do not select anyone clock, 1: 80MHz, 2: FOSC, 3(default): XTAL.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_SCLK_EN</name>
              <description>Set 1 to enable uart0 function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART1_PD_CTRL</name>
          <description>UART1 power control register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>UART1_MEM_FORCE_PU</name>
              <description>Set this bit to force power down UART1 memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_MEM_FORCE_PD</name>
              <description>Set this bit to force power up UART1 memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSPI_CONF</name>
          <description>MSPI configuration register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>MSPI_CLK_EN</name>
              <description>Set 1 to enable mspi clock, include mspi pll clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSPI_RST_EN</name>
              <description>Set 0 to reset mspi module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSPI_PLL_CLK_EN</name>
              <description>Set 1 to enable mspi pll clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSPI_CLK_CONF</name>
          <description>MSPI_CLK configuration register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000300</resetValue>
          <fields>
            <field>
              <name>MSPI_FAST_LS_DIV_NUM</name>
              <description>Set as one within (0,1,2) to generate div1(default)/div2/div4 of low-speed clock-source to drive clk_mspi_fast. Only avaiable whe the clck-source is a low-speed clock-source such as XTAL/FOSC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSPI_FAST_HS_DIV_NUM</name>
              <description>Set as one within (3,4,5) to generate div4(default)/div5/div6 of high-speed clock-source to drive clk_mspi_fast. Only avaiable whe the clck-source is a high-speed clock-source such as SPLL.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_CONF</name>
          <description>I2C configuration register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>I2C_CLK_EN</name>
              <description>Set 1 to enable i2c apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_RST_EN</name>
              <description>Set 0 to reset i2c module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_SCLK_CONF</name>
          <description>I2C_SCLK configuration register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400000</resetValue>
          <fields>
            <field>
              <name>I2C_SCLK_DIV_A</name>
              <description>The  denominator of the frequency divider factor of the i2c function clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SCLK_DIV_B</name>
              <description>The numerator of the frequency divider factor of the i2c function clock.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SCLK_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the i2c function clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SCLK_SEL</name>
              <description>set this field to select clock-source. 0(default): XTAL, 1: FOSC.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SCLK_EN</name>
              <description>Set 1 to enable i2c function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UHCI_CONF</name>
          <description>UHCI configuration register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>UHCI_CLK_EN</name>
              <description>Set 1 to enable uhci clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UHCI_RST_EN</name>
              <description>Set 0 to reset uhci module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RMT_CONF</name>
          <description>RMT configuration register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>RMT_CLK_EN</name>
              <description>Set 1 to enable rmt apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_RST_EN</name>
              <description>Set 0 to reset rmt module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RMT_SCLK_CONF</name>
          <description>RMT_SCLK configuration register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00501000</resetValue>
          <fields>
            <field>
              <name>RMT_SCLK_DIV_A</name>
              <description>The  denominator of the frequency divider factor of the rmt function clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_SCLK_DIV_B</name>
              <description>The numerator of the frequency divider factor of the rmt function clock.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_SCLK_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the rmt function clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_SCLK_SEL</name>
              <description>set this field to select clock-source. 0: do not select anyone clock, 1(default): 80MHz, 2: FOSC, 3: XTAL.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_SCLK_EN</name>
              <description>Set 1 to enable rmt function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LEDC_CONF</name>
          <description>LEDC configuration register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>LEDC_CLK_EN</name>
              <description>Set 1 to enable ledc apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_RST_EN</name>
              <description>Set 0 to reset ledc module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LEDC_SCLK_CONF</name>
          <description>LEDC_SCLK configuration register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400000</resetValue>
          <fields>
            <field>
              <name>LEDC_SCLK_SEL</name>
              <description>set this field to select clock-source. 0(default): do not select anyone clock, 1: 80MHz, 2: FOSC, 3: XTAL.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_SCLK_EN</name>
              <description>Set 1 to enable ledc function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERGROUP0_CONF</name>
          <description>TIMERGROUP0 configuration register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>TG0_CLK_EN</name>
              <description>Set 1 to enable timer_group0 apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_RST_EN</name>
              <description>Set 0 to reset timer_group0 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERGROUP0_TIMER_CLK_CONF</name>
          <description>TIMERGROUP0_TIMER_CLK configuration register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400000</resetValue>
          <fields>
            <field>
              <name>TG0_TIMER_CLK_SEL</name>
              <description>set this field to select clock-source. 0(default): XTAL, 1: 80MHz, 2: FOSC, 3: reserved.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_TIMER_CLK_EN</name>
              <description>Set 1 to enable timer_group0 timer clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERGROUP0_WDT_CLK_CONF</name>
          <description>TIMERGROUP0_WDT_CLK configuration register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400000</resetValue>
          <fields>
            <field>
              <name>TG0_WDT_CLK_SEL</name>
              <description>set this field to select clock-source. 0(default): XTAL, 1: 80MHz, 2: FOSC, 3: reserved.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_WDT_CLK_EN</name>
              <description>Set 1 to enable timer_group0 wdt clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERGROUP1_CONF</name>
          <description>TIMERGROUP1 configuration register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>TG1_CLK_EN</name>
              <description>Set 1 to enable timer_group1 apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_RST_EN</name>
              <description>Set 0 to reset timer_group1 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERGROUP1_TIMER_CLK_CONF</name>
          <description>TIMERGROUP1_TIMER_CLK configuration register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400000</resetValue>
          <fields>
            <field>
              <name>TG1_TIMER_CLK_SEL</name>
              <description>set this field to select clock-source. 0(default): XTAL, 1: 80MHz, 2: FOSC, 3: reserved.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_TIMER_CLK_EN</name>
              <description>Set 1 to enable timer_group1 timer clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERGROUP1_WDT_CLK_CONF</name>
          <description>TIMERGROUP1_WDT_CLK configuration register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400000</resetValue>
          <fields>
            <field>
              <name>TG1_WDT_CLK_SEL</name>
              <description>set this field to select clock-source. 0(default): XTAL, 1: 80MHz, 2: FOSC, 3: reserved.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_WDT_CLK_EN</name>
              <description>Set 1 to enable timer_group0 wdt clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
