ZigEmbeddedGroup/microzig/port/espressif/esp/src/chips/ESP32-C6.svd
        <register>
          <name>SLC0HOST_INT_ST</name>
          <description>*******Description***********</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLC0_TOHOST_BIT0_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT1_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT2_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT3_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT4_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT5_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT6_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT7_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_TOKEN0_1TO0_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_TOKEN1_1TO0_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_TOKEN0_0TO1_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_TOKEN1_0TO1_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0HOST_RX_SOF_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0HOST_RX_EOF_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0HOST_RX_START_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0HOST_TX_START_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_RX_UDF_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_TX_OVF_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_RX_PF_VALID_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_EXT_BIT0_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_EXT_BIT1_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_EXT_BIT2_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_EXT_BIT3_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_RX_NEW_PACKET_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC0_HOST_RD_RETRY_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO_SDIO_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1HOST_INT_ST</name>
          <description>*******Description***********</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLC1_TOHOST_BIT0_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT1_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT2_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT3_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT4_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT5_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT6_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT7_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_TOKEN0_1TO0_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_TOKEN1_1TO0_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_TOKEN0_0TO1_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_TOKEN1_0TO1_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1HOST_RX_SOF_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1HOST_RX_EOF_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1HOST_RX_START_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1HOST_TX_START_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_RX_UDF_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_TX_OVF_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_RX_PF_VALID_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_EXT_BIT0_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_EXT_BIT1_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_EXT_BIT2_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_EXT_BIT3_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_WIFI_RX_NEW_PACKET_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_HOST_RD_RETRY_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_BT_RX_NEW_PACKET_INT_ST</name>
              <description>*******Description***********</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_LEN</name>
          <description>*******Description***********</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HOSTSLCHOST_SLC0_LEN</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HOSTSLCHOST_SLC0_LEN_CHECK</name>
              <description>*******Description***********</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE_W0</name>
          <description>*******Description***********</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_STATE0</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLCHOST_STATE1</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLCHOST_STATE2</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLCHOST_STATE3</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE_W1</name>
          <description>*******Description***********</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_STATE4</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLCHOST_STATE5</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLCHOST_STATE6</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLCHOST_STATE7</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF_W0</name>
          <description>*******Description***********</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_CONF0</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF1</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF2</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF3</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF_W1</name>
          <description>*******Description***********</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_CONF4</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF5</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF6</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF7</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF_W2</name>
          <description>*******Description***********</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_CONF8</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF9</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF10</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF11</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF_W3</name>
          <description>*******Description***********</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <resetValue>0x000000C0</resetValue>
          <fields>
            <field>
              <name>SLCHOST_CONF12</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF13</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF14</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF15</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
