ZigEmbeddedGroup/microzig/port/espressif/esp/src/chips/ESP32-C6.svd
        <register>
          <name>CONF_W4</name>
          <description>*******Description***********</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x000001FF</resetValue>
          <fields>
            <field>
              <name>SLCHOST_CONF16</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF17</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF18</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF19</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF_W5</name>
          <description>*******Description***********</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_CONF20</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF21</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF22</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF23</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WIN_CMD</name>
          <description>*******Description***********</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_WIN_CMD</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF_W6</name>
          <description>*******Description***********</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_CONF24</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF25</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF26</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF27</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF_W7</name>
          <description>*******Description***********</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_CONF28</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF29</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF30</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF31</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_LEN0</name>
          <description>*******Description***********</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HOSTSLCHOST_SLC0_LEN0</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HOSTSLCHOST_SLC0_LEN0_CHECK</name>
              <description>*******Description***********</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_LEN1</name>
          <description>*******Description***********</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HOSTSLCHOST_SLC0_LEN1</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HOSTSLCHOST_SLC0_LEN1_CHECK</name>
              <description>*******Description***********</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_LEN2</name>
          <description>*******Description***********</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HOSTSLCHOST_SLC0_LEN2</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HOSTSLCHOST_SLC0_LEN2_CHECK</name>
              <description>*******Description***********</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF_W8</name>
          <description>*******Description***********</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_CONF32</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF33</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF34</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF35</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF_W9</name>
          <description>*******Description***********</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_CONF36</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF37</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF38</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF39</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF_W10</name>
          <description>*******Description***********</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_CONF40</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF41</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF42</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF43</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF_W11</name>
          <description>*******Description***********</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_CONF44</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF45</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF46</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF47</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF_W12</name>
          <description>*******Description***********</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_CONF48</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF49</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF50</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF51</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF_W13</name>
          <description>*******Description***********</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_CONF52</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF53</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF54</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF55</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF_W14</name>
          <description>*******Description***********</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_CONF56</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF57</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF58</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF59</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF_W15</name>
          <description>*******Description***********</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_CONF60</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF61</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF62</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_CONF63</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHECK_SUM0</name>
          <description>*******Description***********</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_CHECK_SUM0</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHECK_SUM1</name>
          <description>*******Description***********</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000013F</resetValue>
          <fields>
            <field>
              <name>SLCHOST_CHECK_SUM1</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1HOST_TOKEN_RDATA</name>
          <description>*******Description***********</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLC1_TOKEN0</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_RX_PF_VALID</name>
              <description>*******Description***********</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HOSTSLCHOST_SLC1_TOKEN1</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLC1_RX_PF_EOF</name>
              <description>*******Description***********</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0HOST_TOKEN_WDATA</name>
          <description>*******Description***********</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLC0HOST_TOKEN0_WD</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0HOST_TOKEN1_WD</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1HOST_TOKEN_WDATA</name>
          <description>*******Description***********</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLC1HOST_TOKEN0_WD</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1HOST_TOKEN1_WD</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
