ZigEmbeddedGroup/microzig/port/espressif/esp/src/chips/ESP32-C6.svd
        <register>
          <name>SLC1HOST_FUNC2_INT_ENA</name>
          <description>*******Description***********</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FN2_SLC1_TOHOST_BIT0_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_TOHOST_BIT1_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_TOHOST_BIT2_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_TOHOST_BIT3_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_TOHOST_BIT4_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_TOHOST_BIT5_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_TOHOST_BIT6_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_TOHOST_BIT7_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_TOKEN0_1TO0_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_TOKEN1_1TO0_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_TOKEN0_0TO1_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_TOKEN1_0TO1_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1HOST_RX_SOF_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1HOST_RX_EOF_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1HOST_RX_START_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1HOST_TX_START_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_RX_UDF_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_TX_OVF_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_RX_PF_VALID_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_EXT_BIT0_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_EXT_BIT1_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_EXT_BIT2_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_EXT_BIT3_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_WIFI_RX_NEW_PACKET_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_HOST_RD_RETRY_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2_SLC1_BT_RX_NEW_PACKET_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0HOST_INT_ENA</name>
          <description>*******Description***********</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLC0_TOHOST_BIT0_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT1_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT2_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT3_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT4_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT5_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT6_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT7_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOKEN0_1TO0_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOKEN1_1TO0_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOKEN0_0TO1_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOKEN1_0TO1_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0HOST_RX_SOF_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0HOST_RX_EOF_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0HOST_RX_START_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0HOST_TX_START_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_RX_UDF_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TX_OVF_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_RX_PF_VALID_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_EXT_BIT0_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_EXT_BIT1_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_EXT_BIT2_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_EXT_BIT3_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_RX_NEW_PACKET_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_HOST_RD_RETRY_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_SDIO_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1HOST_INT_ENA</name>
          <description>*******Description***********</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLC1_TOHOST_BIT0_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT1_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT2_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT3_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT4_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT5_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT6_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT7_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOKEN0_1TO0_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOKEN1_1TO0_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOKEN0_0TO1_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOKEN1_0TO1_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1HOST_RX_SOF_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1HOST_RX_EOF_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1HOST_RX_START_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1HOST_TX_START_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_RX_UDF_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TX_OVF_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_RX_PF_VALID_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_EXT_BIT0_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_EXT_BIT1_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_EXT_BIT2_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_EXT_BIT3_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_WIFI_RX_NEW_PACKET_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_HOST_RD_RETRY_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_BT_RX_NEW_PACKET_INT_ENA</name>
              <description>*******Description***********</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0HOST_RX_INFOR</name>
          <description>*******Description***********</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLC0HOST_RX_INFOR</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1HOST_RX_INFOR</name>
          <description>*******Description***********</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLC1HOST_RX_INFOR</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
