ZigEmbeddedGroup/microzig/port/espressif/esp/src/chips/ESP32-C6.svd
        <register>
          <name>SLC0HOST_LEN_WD</name>
          <description>*******Description***********</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLC0HOST_LEN_WD</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC_APBWIN_WDATA</name>
          <description>*******Description***********</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLC_APBWIN_WDATA</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC_APBWIN_CONF</name>
          <description>*******Description***********</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLC_APBWIN_ADDR</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC_APBWIN_WR</name>
              <description>*******Description***********</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC_APBWIN_START</name>
              <description>*******Description***********</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC_APBWIN_RDATA</name>
          <description>*******Description***********</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLC_APBWIN_RDATA</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDCLR0</name>
          <description>*******Description***********</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <resetValue>0x0003C044</resetValue>
          <fields>
            <field>
              <name>SLCHOST_SLC0_BIT7_CLRADDR</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_SLC0_BIT6_CLRADDR</name>
              <description>*******Description***********</description>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDCLR1</name>
          <description>*******Description***********</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <resetValue>0x0003C1E0</resetValue>
          <fields>
            <field>
              <name>SLCHOST_SLC1_BIT7_CLRADDR</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLCHOST_SLC1_BIT6_CLRADDR</name>
              <description>*******Description***********</description>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0HOST_INT_ENA1</name>
          <description>*******Description***********</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLC0_TOHOST_BIT0_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT1_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT2_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT3_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT4_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT5_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT6_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOHOST_BIT7_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOKEN0_1TO0_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOKEN1_1TO0_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOKEN0_0TO1_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TOKEN1_0TO1_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0HOST_RX_SOF_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0HOST_RX_EOF_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0HOST_RX_START_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0HOST_TX_START_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_RX_UDF_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_TX_OVF_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_RX_PF_VALID_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_EXT_BIT0_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_EXT_BIT1_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_EXT_BIT2_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_EXT_BIT3_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_RX_NEW_PACKET_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC0_HOST_RD_RETRY_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_SDIO_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1HOST_INT_ENA1</name>
          <description>*******Description***********</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLC1_TOHOST_BIT0_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT1_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT2_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT3_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT4_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT5_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT6_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOHOST_BIT7_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOKEN0_1TO0_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOKEN1_1TO0_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOKEN0_0TO1_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TOKEN1_0TO1_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1HOST_RX_SOF_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1HOST_RX_EOF_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1HOST_RX_START_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1HOST_TX_START_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_RX_UDF_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_TX_OVF_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_RX_PF_VALID_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_EXT_BIT0_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_EXT_BIT1_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_EXT_BIT2_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_EXT_BIT3_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_WIFI_RX_NEW_PACKET_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_HOST_RD_RETRY_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC1_BT_RX_NEW_PACKET_INT_ENA1</name>
              <description>*******Description***********</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLCHOSTDATE</name>
          <description>*******Description***********</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <resetValue>0x21060700</resetValue>
          <fields>
            <field>
              <name>SLCHOST_DATE</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLCHOSTID</name>
          <description>*******Description***********</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000600</resetValue>
          <fields>
            <field>
              <name>SLCHOST_ID</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <description>*******Description***********</description>
          <addressOffset>0x1F0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRC_SDIO11</name>
              <description>*******Description***********</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRC_SDIO20</name>
              <description>*******Description***********</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRC_NEG_SAMP</name>
              <description>*******Description***********</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRC_POS_SAMP</name>
              <description>*******Description***********</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRC_QUICK_IN</name>
              <description>*******Description***********</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO20_INT_DELAY</name>
              <description>*******Description***********</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_PAD_PULLUP</name>
              <description>*******Description***********</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSPEED_CON_EN</name>
              <description>*******Description***********</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
